-- Получение статистики по заработной плате
WITH stat_value AS 
	(SELECT 
		round(AVG(salary_from), 0) AS avg_salary_from,
		round(AVG(salary_to), 0) AS avg_salary_to,
		MIN(salary_from) AS min_salary_from,
		MAX(salary_from) AS max_salary_from,
		MIN(salary_to) AS min_salary_to,
		MAX(salary_to) AS max_salary_to
	FROM public.parcing_table
	WHERE
		salary_from > 50 AND salary_from IS NOT NULL
		AND salary_to IS NOT NULL
		AND salary_bin <> 'ЗП не указана')
SELECT *
FROM stat_value;

-- avg_salary_from | avg_salary_to | min_salary_from | max_salary_from | min_salary_to | max_salary_to 
-- -----------------+---------------+-----------------+-----------------+---------------+---------------
--       110 870 |     154 322 |            50.0 |        398000.0 |       25000.0 |      497500.0

-- Средняя зарплата в категории «от» составляет около 110 870 рублей, а  
-- в категории «до» — около 154 322 рублей. Это указывает на то, что работодатели готовы платить
-- аналитикам данных и системным аналитикам в среднем 133 000 рублей. 
-- Минимальная предлагаемая зарплата начинается с 25 000 рублей (без учета очевидно ошибочных данных), 
-- а максимальная достигает 497 500 рублей.



-- Количество вакансий по регионам
SELECT
	area,
	count(name) AS count_vacancies
FROM parcing_table
GROUP BY 
	area
ORDER BY 
	count_vacancies DESC
LIMIT 20;

--             area              | count_vacancies 
-- -------------------------------+---------------
--  Москва                        |          1247
--  Санкт-Петербург               |           181
--  Екатеринбург                  |            51
--  Нижний Новгород               |            33
--  Новосибирск                   |            33
-- ...  

-- Москва и Санкт-Петербург — лидеры по количеству вакансий. 
-- Это неудивительно, учитывая, что это крупнейшие города 
-- с развитой инфраструктурой и большим количеством компаний. 
-- В Екатеринбурге, Нижнем Новгороде и Новосибирске также значительное 
-- количество вакансий — это указывает на развитый рынок труда для аналитиков данных в этих регионах.




-- Количество вакансий по компаниям
SELECT
	employer,
	count(name) AS count_vacancies
FROM parcing_table
GROUP BY 
	employer
ORDER BY 
	count_vacancies DESC
LIMIT 20;
-- employer                                                                    | count_vacancies 
-- -----------------------------------------------------------------------------------------------------------------------------------------------+---------------
--  СБЕР                                                                       |           243
--  WILDBERRIES                                                                |            43
--  Ozon                                                                       |            34
--  Банк ВТБ (ПАО)                                                             |            28
--  Т1                                                                         |            26
--  МАГНИТ, Розничная сеть                                                     |            24
--  МТС                                                                        |            22
--  Okko                                                                       |            19
--  Центральный банк Российской Федерации                                      |            16
--  Ростелеком                                                                 |            15
--  Правительство Москвы                                                       |            15
--  Яндекс                                                                     |            15
--  Райффайзен Банк                                                            |            14
-- ...

-- СБЕР предлагает 243 вакансии и является крупнейшим работодателем для аналитиков данных и 
-- системных аналитиков. Это может говорить о значительных инвестициях в аналитику и технологические решения
-- в компании. К тому же в банковской среде всегда нужны аналитики. WILDBERRIES, Ozon 
-- и другие крупные компании также активно ищут специалистов в области данных, 
-- что говорит о высоком спросе на аналитиков в крупных корпорациях. 




-- Количество вакансий по типу занятости
SELECT 
	employment,
    COUNT(*) AS count_vacancies 
FROM public.parcing_table 
GROUP BY 
	employment 
ORDER BY 
	count_vacancies DESC;


--      employment      | count_vacancies 
-- ---------------------+---------------
--  Полная занятость    |          1764
--  Частичная занятость |            16
--  Стажировка          |            16
--  Проектная работа    |             5

-- Подавляющее большинство вакансий (1764) предлагают полную занятость.
-- Это указывает на то, что работодатели предпочитают нанимать 
-- аналитиков данных и системных аналитиков на постоянные позиции.



-- Количество вакансий по графику работы
SELECT 
	schedule,
   	COUNT(*) AS count_vacancies
FROM public.parcing_table 
GROUP BY 
	schedule 
ORDER BY 
	count_vacancies DESC;

--      schedule     | count_vacancies 
-- ------------------+---------------
--  Полный день      |          1441
--  Удаленная работа |           310
--  Гибкий график    |            41
--  Сменный график   |             9



-- Большинство вакансий (1441) предлагают работу с полным днём. 
-- Однако значительное количество вакансий (310) также позволяет 
-- удалённую работу. Это указывает на то, что работодатели готовы быть
-- гибкими в современных условиях.




-- Выявление грейда требуемых специалистов по опыту
SELECT 
	experience,
	COUNT(*) AS count_vacancies
FROM public.parcing_table 
GROUP BY 
	experience 
ORDER BY 
	count_vacancies DESC;

--       experience       | count_vacancies 
-- -----------------------+---------------
--  Junior+ (1-3 years)   |          1091
--  Middle (3-6 years)    |           555
--  Junior (no experience)|           142
--  Senior (6+ years)     |            13


-- Наибольшее количество вакансий предназначено для специалистов с опытом от 1 до 3 лет (Junior+), 
-- что свидетельствует о высоком спросе на специалистов начального и среднего уровней. 
-- Вакансий для Middle-специалистов (3–6 лет) также много, в то время как спрос 
-- на Senior-специалистов (6+ лет) крайне низкий, возможно, из-за узкого круга
-- специалистов с таким уровнем опыта.




-- Определение доли грейдов среди вакансий аналитиков

SELECT experience,
       COUNT(*) AS count_vacancies,
       ROUND(COUNT(*) * 100.0 / 
       (SELECT COUNT(*) 
		FROM public.parcing_table 
		WHERE name LIKE '%Аналитик данных%' 
	   		OR name LIKE '%аналитик данных%'
	   		OR name LIKE '%Системный аналитик%'
	   		OR name LIKE '%системный аналитик%'),
       2) AS percent_vacancies
FROM public.parcing_table
WHERE name LIKE '%Аналитик данных%' 
	OR name LIKE '%аналитик данных%'
	OR name LIKE '%Системный аналитик%'
	OR name LIKE '%системный аналитик%'
GROUP BY 
	experience
ORDER BY 
	percent_vacancies DESC;



--       experience       | count_vacancies | percent_vacancies 
-- -----------------------+---------------+-------------------
--  Junior+ (1-3 years)   |           854   |             64.40
--  Middle (3-6 years)    |           345   |             26.02
--  Junior (no experience)|           121   |              9.13
--  Senior (6+ years)     |             6   |              0.45


-- Большинство вакансий для аналитиков данных и системных аналитиков предназначены
-- для специалистов уровня Junior+ (64.40%) и Middle (26.02%). Это подтверждает высокую 
-- потребность в специалистах начального и среднего уровней. 
-- Доли вакансий для стажёров (9.13%) и Senior (0.45%) значительно ниже.   





-- Определение типичного места работы для аналитиков по различным параметрам
SELECT employer,
       COUNT(*) AS count_vacancies,
       ROUND(AVG(salary_from), 2) AS avg_salary_from,
       ROUND(AVG(salary_to), 2) AS avg_salary_to,
       employment,
       schedule
FROM public.parcing_table 
WHERE name LIKE '%Аналитик данных%' 
	OR name LIKE '%аналитик данных%' 
	OR name LIKE '%Системный аналитик%' 
	OR name LIKE '%системный аналитик%'
GROUP BY 
	employer,
	employment,
	schedule
-- При необходимости можно убрать из выборки данные с пустыми средними зп
--HAVING 
--	AVG(salary_from) IS NOT NULL
--	AND AVG(salary_to) IS NOT NULL
ORDER BY 
	count_vacancies DESC;
-- employer                                         count_vacancies      avg_salary_from      avg_salary_to            employment                schedule     
-- СБЕР                                             117                110583.33            73333.33              Полная занятость           Полный день
-- Банк ВТБ (ПАО)                                   27                                                            Полная занятость           Полный день
-- Ozon                                             23                                                            Полная занятость           Полный день
--...

-- СБЕР выделяется как основной работодатель для аналитиков данных и системных аналитиков 
-- с 117 вакансиями и средней зарплатой от 110583 рублей до 73333 рублей. 
-- Средняя зарплата «до» ниже средней зарплаты «от» — скорее всего, 
--- СБЕР часто пишет сумму «до», не указываю сумму «от». 
-- Основной тип занятости в СБЕР — полная занятость с полным рабочим днём.
-- Банк ВТБ (ПАО) и Ozon также предлагают достаточно вакансий с аналогичными условиями занятости.
-- Это подтверждает тенденцию крупных компаний нанимать аналитиков данных на полную занятость 
-- с фиксированным рабочим графиком.





-- Частота упоминания skills 
-- key_skills_1
-- При необходимости можно сделать анализ и не по главным ключевым навыкам
WITH key_skills AS 
	(SELECT 
		key_skills_1,
		--key_skills_2,
		--key_skills_3,
		--key_skills_4,
		count(*) AS count_key_skills
	FROM public.parcing_table
	-- Из выборки убраны данные с пустыми ячейками навыков
	WHERE 
		key_skills_1 <> ''
		--AND key_skills_2 <> ''
		--AND key_skills_3 <> ''
		--AND key_skills_4 <> ''
	group BY
		key_skills_1
		--key_skills_2,
		--key_skills_3,
		--key_skills_4
	ORDER BY count_key_skills DESC)
SELECT *
FROM key_skills;
-- key_skills_1                           |                             count_key_skills 
-- ------------------------------------------------------------------+-------------
--  Анализ данных                                                    |         312
--  SQL                                                              |         161
--  Документация                                                     |          89
--  MS SQL                                                           |          87
-- ...

-- Среди ключевых навыков чаще упоминается «Анализ данных» (312 упоминаний), 
-- что логично для позиций аналитиков данных. SQL (161 упоминание) и MS SQL (87 упоминаний) также являются
-- важными навыками, что подчёркивает важность работы с базами данных. «Документация» (89 упоминаний) 

--soft_skills_1
WITH soft_skills AS 
	(SELECT 
		soft_skills_1,
		--soft_skills_2,
		--soft_skills_3,
		--soft_skills_4,
		count(*) AS count_soft_skills
	FROM public.parcing_table
	WHERE 
		soft_skills_1 <> ''
		--AND soft_skills_2 <> ''
		--AND soft_skills_3 <> ''
		--AND soft_skills_4 <> ''
	group BY
		soft_skills_1
		--soft_skills_2,
		--soft_skills_3,
		--soft_skills_4
	ORDER BY count_soft_skills DESC)
SELECT *
FROM soft_skills
LIMIT 10;

-- soft_skills_1                           |                             count_soft_skills
-- ------------------------------------------------------------------+-------------
--  Документация                                                     |         234
--  Коммуникация                                                     |         181
--  Аналитическое мышление                                           |         109
--  Проактивность                                                    |          37
--  Креативность													 |			11

--Среди мягких навыков лидируют "Документация" (234 упоминаний). Неудивительно, что навык, который
-- позволяет без путаницы работать команде, на первом месте.
-- "Коммуникация" (181 упоминаний). Этот навык важен почти в любой профессии.
-- "Аналитическое мышление". Очевидный навык для вакансии "Аналитика данных"
